In [2]:
import pandas as pd

In [3]:
pd

In [4]:
scores = {'國文':{'王小明':65,'李小美':90,'陳大同':81,'林小玉':79},
          '英文':{'王小明':92,'李小美':72,'陳大同':85,'林小玉':53},
          '數學':{'王小明':78,'李小美':76,'陳大同':91,'林小玉':47},
          '自然':{'王小明':83,'李小美':93,'陳大同':89,'林小玉':94},
          '社會':{'王小明':70,'李小美':56,'陳大同':94,'林小玉':80}}
df5 = pd.DataFrame(scores)
df5

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [5]:
df5.iloc[3,4]

80

In [6]:
df5.iloc[1,0]

90

In [7]:
df5.iloc[2,3]

89

In [8]:
df5.iloc[0,[0,4]]

國文    65
社會    70
Name: 王小明, dtype: int64

In [9]:
df5.iloc[[0,1],[2,3]]

     數學  自然
王小明  78  83
李小美  76  93

In [10]:
df5.iloc[[2,3],[3,4]]

     自然  社會
陳大同  89  94
林小玉  94  80

In [11]:
df5.iloc[0:3,2:5]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56
陳大同  91  89  94

In [12]:
df5.iloc[2,:]

國文    81
英文    85
數學    91
自然    89
社會    94
Name: 陳大同, dtype: int64

In [13]:
df5.iloc[3,:]

國文    79
英文    53
數學    47
自然    94
社會    80
Name: 林小玉, dtype: int64

In [14]:
df5.iloc[1:,2:5]

     數學  自然  社會
李小美  76  93  56
陳大同  91  89  94
林小玉  47  94  80

In [15]:
df5.head(2)

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56

In [16]:
df5.tail(2)

     國文  英文  數學  自然  社會
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [17]:
df5.head(1)

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70

In [18]:
df5.tail(1)

     國文  英文  數學  自然  社會
林小玉  79  53  47  94  80

In [19]:
df5.head(3)

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94

In [20]:
df5.tail(3)

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [22]:
df5.sort_values(by='數學',ascending=False)

     國文  英文  數學  自然  社會
陳大同  81  85  91  89  94
王小明  65  92  78  83  70
李小美  90  72  76  93  56
林小玉  79  53  47  94  80

In [23]:
df5.sort_values(by='數學',ascending=True)

     國文  英文  數學  自然  社會
林小玉  79  53  47  94  80
李小美  90  72  76  93  56
王小明  65  92  78  83  70
陳大同  81  85  91  89  94

In [24]:
df5.sort_values(by='英文',ascending=False)

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
陳大同  81  85  91  89  94
李小美  90  72  76  93  56
林小玉  79  53  47  94  80

In [25]:
df5.sort_values(by='英文',ascending=True)

     國文  英文  數學  自然  社會
林小玉  79  53  47  94  80
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
王小明  65  92  78  83  70

In [26]:
df5.sort_index(axis=0)

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
林小玉  79  53  47  94  80
王小明  65  92  78  83  70
陳大同  81  85  91  89  94

In [27]:
df5.sort_index(axis=1)

     國文  數學  社會  自然  英文
王小明  65  78  70  83  92
李小美  90  76  56  93  72
陳大同  81  91  94  89  85
林小玉  79  47  80  94  53

In [31]:
scores = {'國文':{'王小明':65,'李小美':90,'陳大同':81,'林小玉':79},
          '英文':{'王小明':92,'李小美':72,'陳大同':85,'林小玉':53},
          '數學':{'王小明':78,'李小美':76,'陳大同':91,'林小玉':47},
          '自然':{'王小明':83,'李小美':93,'陳大同':89,'林小玉':94},
          '社會':{'王小明':70,'李小美':56,'陳大同':94,'林小玉':80}}
df6 = pd.DataFrame(scores)
df6

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [32]:
df6.loc['王小明']['數學']=90
df6

     國文  英文  數學  自然  社會
王小明  65  92  90  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [34]:
df6.loc['陳大同'][:]=80
df6

     國文  英文  數學  自然  社會
王小明  65  92  90  83  70
李小美  90  72  76  93  56
陳大同  80  80  80  80  80
林小玉  79  53  47  94  80

In [35]:
df6.loc['李小美']['社會']=100
df6

     國文  英文  數學  自然   社會
王小明  65  92  90  83   70
李小美  90  72  76  93  100
陳大同  80  80  80  80   80
林小玉  79  53  47  94   80

In [36]:
df6.loc['林小玉'][:]=60
df6

     國文  英文  數學  自然   社會
王小明  65  92  90  83   70
李小美  90  72  76  93  100
陳大同  80  80  80  80   80
林小玉  60  60  60  60   60

In [37]:
df6.loc['王小明'][:]=50
df6

     國文  英文  數學  自然   社會
王小明  50  50  50  50   50
李小美  90  72  76  93  100
陳大同  80  80  80  80   80
林小玉  60  60  60  60   60

In [38]:
scores = {'國文':{'王小明':65,'李小美':90,'陳大同':81,'林小玉':79},
          '英文':{'王小明':92,'李小美':72,'陳大同':85,'林小玉':53},
          '數學':{'王小明':78,'李小美':76,'陳大同':91,'林小玉':47},
          '自然':{'王小明':83,'李小美':93,'陳大同':89,'林小玉':94},
          '社會':{'王小明':70,'李小美':56,'陳大同':94,'林小玉':80}}
df7 = pd.DataFrame(scores)
df7

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [39]:
df7.drop('王小明')

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [40]:
df7.drop('數學',axis=1)

     國文  英文  自然  社會
王小明  65  92  83  70
李小美  90  72  93  56
陳大同  81  85  89  94
林小玉  79  53  94  80

In [41]:
df7.drop(['數學','自然'],axis=1)

     國文  英文  社會
王小明  65  92  70
李小美  90  72  56
陳大同  81  85  94
林小玉  79  53  80

In [42]:
df7.drop(df7.columns[1:4],axis=1)

     國文  社會
王小明  65  70
李小美  90  56
陳大同  81  94
林小玉  79  80